# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv9t object detection model. For Usage examples see https://docs.ultralytics.com/models/yolov9
# 917 layers, 2128720 parameters, 8.5 GFLOPs

# Parameters
nc: 80 # number of classes  CAM, ['weight']

# GELAN backbone
backbone:
  - [-1, 1, EfficientViT_M1, []]  # 4
  - [-1, 1, SPPELAN, [128, 64]] # 5

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]] # cat backbone P4
  - [-1, 1, RepNCSPELAN4, [96, 96, 48, 3]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P3
  - [-1, 1, RepNCSPELAN4, [64, 64, 32, 3]] # 15

  - [-1, 1, AConv, [48]]
  - [[-1, 8], 1, Concat, [1]] # cat head P4
  - [-1, 1, RepNCSPELAN4, [96, 96, 48, 3]] # 18 (P4/16-medium)

  - [-1, 1, AConv, [64]]
  - [[-1, 5], 1, Concat, [1]] # cat head P5
  - [-1, 1, RepNCSPELAN4, [128, 128, 64, 3]] # 21 (P5/32-large)

  - [[11, 14, 17], 1, Detect, [nc]] # Detect(P3, P4, P5)
